micropython/micropython/ports/esp32/boards/UM_TINYWATCHS3/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "TinyWATCH S3"
#define MICROPY_HW_MCU_NAME                 "ESP32-S3-PICO-1-N8R2"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "TinyWATCHS3"

#define MICROPY_HW_I2C0_SCL                 (9)
#define MICROPY_HW_I2C0_SDA                 (8)

#define MICROPY_HW_SPI1_MOSI                (35)
#define MICROPY_HW_SPI1_MISO                (37)
#define MICROPY_HW_SPI1_SCK                 (36)

#define MICROPY_HW_USB_VID 0x303A
#define MICROPY_HW_USB_PID 0x81B1
#define MICROPY_HW_USB_MANUFACTURER_STRING "Unexpected Maker"
#define MICROPY_HW_USB_PRODUCT_FS_STRING "TinyWATCHS3"
